<?php
// Heading
$_['heading_title']                = 'Playful Sparkle - Google Tag Manager';
$_['heading_fix']                  = 'Исправить общие ошибки';
$_['heading_getting_started']      = 'Начало работы';
$_['heading_setup']                = 'Настройка Google Tag Manager';
$_['heading_troubleshot']          = 'Типичные проблемы';
$_['heading_faq']                  = 'Часто задаваемые вопросы';
$_['heading_contact']              = 'Связаться с поддержкой';

// Text
$_['text_extension']                = 'Расширения';
$_['text_edit']                     = 'Редактировать Google Tag Manager';
$_['text_success']                  = 'Успех: Вы изменили настройки Google Tag Manager!';
$_['text_group_ad_settings']        = 'Настройки рекламы';
$_['text_group_analytics_settings'] = 'Настройки аналитики';
$_['text_group_security_settings']  = 'Настройки безопасности';
$_['text_group_advanced_settings']  = 'Расширенные настройки';
$_['text_getting_started']          = '<p><strong>Обзор:</strong> Расширение Playful Sparkle - Google Tag Manager для OpenCart 4.x позволяет легко управлять и развертывать маркетинговые теги на вашем магазине OpenCart без необходимости в навыках программирования. С помощью этого расширения вы можете упростить настройку отслеживания, улучшив аналитику и эффективность маркетинга.</p><p><strong>Требования:</strong> Убедитесь, что у вас есть учетная запись в Google Tag Manager, действующий идентификатор измерений и вы используете совместимую версию OpenCart 4.x+, PHP 7.4+.</p>';
$_['text_setup']                    = '<p><strong>Настройка Google Tag Manager:</strong> Войдите в свою <a href="https://tagmanager.google.com" target="_blank" rel="noopener noreferrer">учетную запись Google Tag Manager</a>, создайте новый контейнер для вашего сайта, если вы этого еще не сделали, и получите идентификатор измерений. Затем введите этот идентификатор в соответствующее поле настроек расширения Playful Sparkle - Google Tag Manager в вашем магазине OpenCart.</p>';
$_['text_troubleshot']              = '<ul><li><strong>Не найден идентификатор измерений:</strong> Проверьте, что вы правильно ввели идентификатор измерений в настройках расширения. Убедитесь, что нет лишних пробелов или неверных символов.</li><li><strong>Теги не активируются:</strong> Убедитесь, что ваши теги правильно настроены в Google Tag Manager с корректными триггерами. Вы можете использовать <a href="https://tagassistant.google.com/" target="_blank" rel="noopener noreferrer">Google Tag Assistant</a> для устранения проблем с активацией тегов.</li><li><strong>Проблемы с разрешениями:</strong> Убедитесь, что у вас есть необходимые разрешения в вашей учетной записи Google Tag Manager для создания и управления тегами.</li><li><strong>Проблемы с совместимостью:</strong> Убедитесь, что ваша версия OpenCart актуальна и что другие установленные расширения не конфликтуют с настройкой Google Tag Manager.</li></ul>';
$_['text_faq']                      = '<details><summary>Что делать, если мои теги не активируются в Google Tag Manager?</summary>Убедитесь, что ваш идентификатор измерений правильный и что теги опубликованы и настроены с правильными триггерами.</details><details><summary>Как я могу проверить, работает ли расширение?</summary>Используйте <a href="https://tagassistant.google.com/" target="_blank" rel="noopener noreferrer">расширение Google Tag Assistant</a> для Chrome или режим предварительного просмотра в Google Tag Manager, чтобы убедиться, что ваши теги активируются как ожидалось.</details><details><summary>Совместимо ли это расширение с другими расширениями?</summary>Хотя это расширение в целом совместимо, рекомендуется тестировать его с другими установленными расширениями, чтобы избежать конфликтов. Если возникнут проблемы, проверьте известные проблемы совместимости.</details><details><summary>Как устранить типичные проблемы с тегами?</summary>Обратитесь к руководству по устранению неполадок Google Tag Manager для получения помощи по типичным проблемам с тегами и лучшим практикам настройки.</details>';
$_['text_contact']                  = '<p>Для получения дополнительной помощи свяжитесь с нашей службой поддержки:</p><ul><li><strong>Контакт:</strong> <a href="mailto:%s">%s</a></li><li><strong>Документация:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Документация пользователя</a></li></ul>';
$_['text_gcm_info']                 = 'Для использования этой функции убедитесь, что у вас установлен баннер cookie. Это расширение по умолчанию устанавливает базовое состояние согласия, но баннер cookie отвечает за обновление согласия для разрешения сбора данных.';

// Tab
$_['tab_general']                   = 'Основное';
$_['tab_gcm']                       = 'Режим согласия Google (GCM)';
$_['tab_help_and_support']          = 'Помощь и поддержка';

// Entry
$_['entry_status']                  = 'Статус';
$_['entry_gtm_id']                  = 'Идентификатор измерений';
$_['entry_gcm_status']              = 'Включить GCM';
$_['entry_ad_storage']              = 'Хранение данных рекламы';
$_['entry_ad_user_data']            = 'Данные пользователей рекламы';
$_['entry_ad_personalization']      = 'Персонализация рекламы';
$_['entry_analytics_storage']       = 'Хранение данных аналитики';
$_['entry_functionality_storage']   = 'Хранение данных функциональности';
$_['entry_personalization_storage'] = 'Хранение данных персонализации';
$_['entry_security_storage']        = 'Хранение данных безопасности';
$_['entry_wait_for_update']         = 'Ожидание обновления';
$_['entry_ads_data_redaction']      = 'Редакция данных рекламы';
$_['entry_url_passthrough']         = 'Пропуск URL';
$_['entry_strict']                  = 'Строгий';
$_['entry_balanced']                = 'Сбалансированный';
$_['entry_custom']                  = 'Пользовательский';
$_['entry_gcm_profiles']            = 'Профили GCM';

// Button
$_['button_fix_event_handler']      = 'Исправить обработчик событий';

// Help
$_['help_ad_storage']               = 'Управляет разрешением на хранение данных для рекламных целей, таких как отслеживание кликов по рекламе или конверсий.';
$_['help_ad_user_data']             = 'Определяет, будут ли храниться данные о пользователях, взаимодействующих с рекламой, улучшая возможности таргетинга.';
$_['help_ad_personalization']       = 'Позволяет персонализировать рекламу на основе данных о пользователях, предлагая более релевантные рекламные материалы.';
$_['help_analytics_storage']        = 'Включает хранение данных, используемых для аналитики, помогая отслеживать производительность сайта и поведение пользователей.';
$_['help_functionality_storage']    = 'Позволяет хранить данные, поддерживающие функциональность, такие как предпочтения пользователей или функции сайта, улучшая пользовательский опыт.';
$_['help_personalization_storage']  = 'Управляет хранением данных для персонализации пользовательского опыта, например, для рекомендованных материалов или настроек.';
$_['help_security_storage']         = 'Обеспечивает хранение данных, связанных с безопасностью, например, для предотвращения мошенничества и контроля доступа.';
$_['help_wait_for_update']          = 'Устанавливает время (в миллисекундах) ожидания перед обновлением статуса согласия, чтобы все настройки были применены.';
$_['help_ads_data_redaction']       = 'Редактирует данные пользователей, связанные с рекламой, обеспечивая конфиденциальность, скрывая определенную информацию, которая может быть идентифицируемой.';
$_['help_url_passthrough']          = 'Разрешает пропуск URL через проверки согласия, что полезно для отслеживания определенных путей пользователей без хранения персональных данных.';
$_['help_gcm_status']               = 'Включает режим согласия Google, позволяя вашему сайту адаптировать поведение тегов Google в зависимости от настроек согласия пользователей. Этот режим обеспечивает конфиденциальное отслеживание, позволяя аналитике и рекламе работать в соответствии с предпочтениями согласия.';
$_['help_gtm_id_locate']            = 'Чтобы найти ваш идентификатор измерений, войдите в вашу <a href="https://tagmanager.google.com" target="_blank" rel="external noopener noreferrer">учетную запись Google Tag Manager</a>. В рабочем пространстве ищите идентификатор в верхней части панели инструментов — он начинается с "GTM-" и за ним идет уникальная последовательность букв и цифр, например, "GTM-XXXXXXXX". <a href="https://support.google.com/analytics/answer/12270356?hl=en" target="_blank" rel="external noopener noreferrer">Подробные инструкции здесь</a>.';

// Error
$_['error_permission']              = 'Внимание: У вас нет прав на изменение настроек Google Tag Manager!';
$_['error_gtm_id']                  = 'Поле идентификатора GTM обязательно для заполнения. Пожалуйста, введите ваш идентификатор измерений.';
$_['error_gtm_id_invalid']          = 'Формат идентификатора GTM неверный. Убедитесь, что он соответствует формату GTM-XXXXXXXX.';
$_['error_wait_for_update']         = 'Значение для Ожидание обновления должно быть числом от 0 до 10000 миллисекунд.';
